/*
            УРОК 5

При написании кода обращать внимание на 
1. Имя переменных
2. Имя метода
3. Имена аргументов метода
Не нужно экономить на понятности
Не использовать сокращения
Не использовать запрещенные наименовании
Используйте простые слова
Не материться
Не используйте нижнее подчеркивание, минусы
Не сокращайте имена
Имена метода с большой буквы, аргументы - с маленькой
Избегайте длинных строк, переносите на другие
Методы с методами, аргументы с аргументами
Используйте синтактические правила, присущие языку программирования
Используем библиотеки
Задачи разбивать на подзадачи
*/